# TRABALHO PRÁTICO 1

  O objetivo desse trabalho é avaliar a capacidade do aluno de gerar consultas em SQL a partir das questões propostas.

**IMPORTANTE**:

1.   Altere apenas dentro das aspas duplas onde estiver escrito *Altere Aqui*.
2.   Não serão necessárias alterações em funções ou outras partes do código.
3.   Após finalizar todas as consultas, clique em *Kernel -> Restart and Run All* no ambiente Jupyter.
4.   Altere o nome do arquivo *TP1_matricula.ipynb* adicionando o seu número de matrícula substituindo onde está escrito matrícula.
5.   Um arquivo *.csv* com a sua matrícula será gerado automaticamente no diretório do ambiente.
6.   Compactar os arquivos *TP1_matricula.ipynb* e *matricula.csv* em *matricula.zip* e submeter na tarefa criada para o TP1 via Moodle.

In [1]:
#NÃO ALTERE AS LINHAS ABAIXO
import sys
!{sys.executable} -m pip install sqlite3
!{sys.executable} -m pip install pandas
!{sys.executable} -m pip install csv
!{sys.executable} -m pip install gdown

ERROR: Could not find a version that satisfies the requirement sqlite3 (from versions: none)
ERROR: No matching distribution found for sqlite3

Requirement already satisfied: pandas in c:\users\annyc\onedrive\documentos\coding\anaconda3\lib\site-packages (1.5.3)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\annyc\onedrive\documentos\coding\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\annyc\onedrive\documentos\coding\anaconda3\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: numpy>=1.21.0 in c:\users\annyc\onedrive\documentos\coding\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: six>=1.5 in c:\users\annyc\onedrive\documentos\coding\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

ERROR: Could not find a version that satisfies the requirement csv (from versions: none)
ERROR: No matching distribution found for csv

Requirement already satisfied: gdown in c:\users\annyc\onedrive\documentos\coding\anaconda3\lib\site-packages (5.2.0)
Requirement already satisfied: beautifulsoup4 in c:\users\annyc\onedrive\documentos\coding\anaconda3\lib\site-packages (from gdown) (4.12.2)
Requirement already satisfied: filelock in c:\users\annyc\onedrive\documentos\coding\anaconda3\lib\site-packages (from gdown) (3.13.1)
Requirement already satisfied: requests[socks] in c:\users\annyc\onedrive\documentos\coding\anaconda3\lib\site-packages (from gdown) (2.31.0)
Requirement already satisfied: tqdm in c:\users\annyc\onedrive\documentos\coding\anaconda3\lib\site-packages (from gdown) (4.65.0)
Requirement already satisfied: soupsieve>1.2 in c:\users\annyc\onedrive\documentos\coding\anaconda3\lib\site-packages (from beautifulsoup4->gdown) (2.5)
Requirement already satisfied: charset-normalizer<4,>=2 in c:\users\annyc\onedrive\documentos\coding\anaconda3\lib\site-packages (from requests[socks]->gdown) (2.0.4)
Requirement already satisfied: idna<4,>=2.5 in c:\users\annyc\onedrive\documentos\coding\anaconda3\lib\site-packages (from requests[socks]->gdown) (3.4)
Requirement already satisfied: urllib3<3,>=1.21.1 in c:\users\annyc\onedrive\documentos\coding\anaconda3\lib\site-packages (from requests[socks]->gdown) (1.26.20)
Requirement already satisfied: certifi>=2017.4.17 in c:\users\annyc\onedrive\documentos\coding\anaconda3\lib\site-packages (from requests[socks]->gdown) (2024.2.2)
Requirement already satisfied: PySocks!=1.5.7,>=1.5.6 in c:\users\annyc\onedrive\documentos\coding\anaconda3\lib\site-packages (from requests[socks]->gdown) (1.7.1)
Requirement already satisfied: colorama in c:\users\annyc\onedrive\documentos\coding\anaconda3\lib\site-packages (from tqdm->gdown) (0.4.6)

In [2]:
#NÃO ALTERE AS LINHAS ABAIXO
import sqlite3 as sql3
import pandas as pd
import csv

## Banco de Dados

In [3]:
# Conectar ao banco de dados
conn = sql3.connect("cineufmg.db")
cursor = conn.cursor()

# Ler e executar o schema SQL
with open("schema.sql", "r", encoding="utf-8") as f:
    schema_sql = f.read()

cursor.executescript(schema_sql)
conn.commit()

# Verificar as tabelas criadas
tabelas = cursor.execute("SELECT name FROM sqlite_master WHERE type='table';").fetchall()
print("Tabelas criadas:", [t[0] for t in tabelas])

# Fechar conexão
conn.close()

Tabelas criadas: ['trailer', 'filmes', 'salas', 'sessoes', 'clientes', 'ingressos']

In [4]:
#NÃO ALTERE AS LINHAS ABAIXO
con = sql3.connect("cineufmg.db")
cur = con.cursor()

## Estrutura das Tabelas do Banco de Dados Despesas

Nas células de 5 a 9 abaixo, estão listadas as informações referentes aos campos e tipos de dados relacionados a todas as tabelas do Banco de Dados Despesas:

### TABELA FILMES

In [5]:
#NÃO ALTERE AS LINHAS ABAIXO
query = "PRAGMA table_info('filmes')"
df = pd.read_sql(query, con)
display(df)

   cid                      name     type  notnull dflt_value  pk
0    0                        id  INTEGER        0       None   1
1    1                    titulo     TEXT        1       None   0
2    2                    genero     TEXT        1       None   0
3    3                   duracao  INTEGER        1       None   0
4    4  classificacao_indicativa  INTEGER        1       None   0

### TABELA SALAS

In [6]:
#NÃO ALTERE AS LINHAS ABAIXO
query = "PRAGMA table_info('salas')"
df = pd.read_sql(query, con)
display(df)

   cid        name     type  notnull dflt_value  pk
0    0          id  INTEGER        0       None   1
1    1        nome     TEXT        1       None   0
2    2  capacidade  INTEGER        1       None   0

### TABELA SESSÕES

In [7]:
#NÃO ALTERE AS LINHAS ABAIXO
query = "PRAGMA table_info('sessoes')"
df = pd.read_sql(query, con)
display(df)

   cid            name     type  notnull dflt_value  pk
0    0              id  INTEGER        0       None   1
1    1        filme_id  INTEGER        1       None   0
2    2         sala_id  INTEGER        1       None   0
3    3       data_hora     TEXT        1       None   0
4    4  preco_ingresso     REAL        1       None   0

### TABELA CLIENTES

In [8]:
#NÃO ALTERE AS LINHAS ABAIXO
query = "PRAGMA table_info('clientes')"
df = pd.read_sql(query, con)
display(df)

   cid             name     type  notnull dflt_value  pk
0    0               id  INTEGER        0       None   1
1    1             nome     TEXT        1       None   0
2    2            email     TEXT        1       None   0
3    3  data_nascimento     TEXT        1       None   0

### TABELA INGRESSOS

In [9]:
#NÃO ALTERE AS LINHAS ABAIXO
query = "PRAGMA table_info('ingressos')"
df = pd.read_sql(query, con)
display(df)

   cid         name     type  notnull dflt_value  pk
0    0           id  INTEGER        0       None   1
1    1    sessao_id  INTEGER        1       None   0
2    2   cliente_id  INTEGER        1       None   0
3    3  data_compra     TEXT        1       None   0

# População do DB

Baseado no exemplo abaixo, incremente a população do seu banco de dados para verificar os resultados das consultas seguintes.

In [10]:
filmes = [
    (1, 'Vingadores Ultimato', 'Ação', 148, 14),
    (2, 'Toy Story', 'Animação', 81, 0),
    (3, 'O Poderoso Chefão', 'Drama', 175, 18)
]

salas = [
    (1, 'Sala 1', 100),
    (2, 'Sala 2', 80)
]

sessoes = [
    (1, 1, 1, '2025-05-12 19:30', 20.0),
    (2, 2, 2, '2025-05-13 14:00', 15.5),
    (3, 3, 1, '2025-05-14 21:00', 25.0)
]

clientes = [
    (1, 'Alice', 'alice@email.com', '2000-01-01'),
    (2, 'Bruno', 'bruno@email.com', '1995-06-15'),
    (3, 'Carla', 'carla@email.com', '2003-11-23')
]

ingressos = [
    (1, 1, 1, '2025-05-10'),
    (2, 2, 2, '2025-05-11'),
    (3, 3, 3, '2025-05-12')
]

cur.executemany("INSERT INTO filmes VALUES (?, ?, ?, ?, ?)", filmes)
cur.executemany("INSERT INTO salas VALUES (?, ?, ?)", salas)
cur.executemany("INSERT INTO sessoes VALUES (?, ?, ?, ?, ?)", sessoes)
cur.executemany("INSERT INTO clientes VALUES (?, ?, ?, ?)", clientes)
cur.executemany("INSERT INTO ingressos VALUES (?, ?, ?, ?)", ingressos)

con.commit()

# Visualizar os dados inseridos
for tabela in ['filmes', 'salas', 'sessoes', 'clientes', 'ingressos']:
    print(f"\nTabela: {tabela}")
    for row in cur.execute(f"SELECT * FROM {tabela}"):
        print(row)

Tabela: filmes
(1, 'Vingadores Ultimato', 'Ação', 148, 14)
(2, 'Toy Story', 'Animação', 81, 0)
(3, 'O Poderoso Chefão', 'Drama', 175, 18)

Tabela: salas
(1, 'Sala 1', 100)
(2, 'Sala 2', 80)

Tabela: sessoes
(1, 1, 1, '2025-05-12 19:30', 20.0)
(2, 2, 2, '2025-05-13 14:00', 15.5)
(3, 3, 1, '2025-05-14 21:00', 25.0)

Tabela: clientes
(1, 'Alice', 'alice@email.com', '2000-01-01')
(2, 'Bruno', 'bruno@email.com', '1995-06-15')
(3, 'Carla', 'carla@email.com', '2003-11-23')

Tabela: ingressos
(1, 1, 1, '2025-05-10')
(2, 2, 2, '2025-05-11')
(3, 3, 3, '2025-05-12')

## Arquivo de Resultados
Na célula 10 abaixo, você irá colocar o numero da sua matrícula. Essa é a primeira alteração necessária para executar o TP. A partir das células 10 e 11, o arquivo de resultado será gerado.

In [11]:
matricula = "2024024046"

In [12]:
#NÃO ALTERE AS LINHAS ABAIXO
tp1_csv = matricula+".csv"
queries = open(tp1_csv, 'w')
writer = csv.writer(queries)
writer.writerow(["Query Number", "Query Size"])

25

## Função de Consulta
A função abaixo executa a consulta, exibe o retorno da consulta no banco e grava os dados necessários no arquivo resultado.

In [13]:
#NÃO ALTERE AS LINHAS ABAIXO
def runQuery(query, query_name):
  df = pd.read_sql(query, con)
  query_size = df.shape
  writer.writerow([query_name, query_size])
  writer.writerow([query, df])
  display(df)

## PARTE 1 - Transformar Algebra Relacional para SQL
Abaixo, seguem as consultas que voce terá de transformar de Algebra Relacional para SQL. Altere **APENAS** o espaço entre as aspas. Dentro desse espaço é que você deverá digitar o comando de execução da consulta.

<b>A1</b> Seleciona todos os filmes com o operador <I>SELECT</I>

In [14]:
a0 = "SELECT * FROM filmes"
#NÃO ALTERE AS LINHAS ABAIXO
runQuery(a0, "a0")

   id               titulo    genero  duracao  classificacao_indicativa
0   1  Vingadores Ultimato      Ação      148                        14
1   2            Toy Story  Animação       81                         0
2   3    O Poderoso Chefão     Drama      175                        18

<b>A2</b> Seleciona o titulo de todos os filmes com o operador <I>SELECT</I> e filtra com operador <I>WHERE</I> os filmes de gênero 'Ação'

In [15]:
a1 = "SELECT titulo FROM filmes WHERE genero = 'Ação';"
#NÃO ALTERE AS LINHAS ABAIXO
runQuery(a1, "a1")

                titulo
0  Vingadores Ultimato

<b>A3</b> Seleciona o nome de todas as salas com o operador <I>SELECT</I> e filtra com operador <I>WHERE</I> as que possuem capacidade maior que 100.

In [16]:
a2 = "SELECT nome FROM salas WHERE capacidade > 100;"
#NÃO ALTERE AS LINHAS ABAIXO
runQuery(a2, "a2")

Empty DataFrame
Columns: [nome]
Index: []

<b>A4</b> Seleciona o titulo de todos os filmes e o preço do ingresso de todas as sessões com o operador <I>SELECT</I>. Utiliza o operador <I>JOIN</I> para combinar as tabelas filmes e sessões,exibindo o valor do ingresso por título nas sessões.

In [17]:
a3 = "SELECT titulo, preco_ingresso FROM filmes JOIN sessoes ON filmes.id = sessoes.filme_id;"
#NÃO ALTERE AS LINHAS ABAIXO
runQuery(a3, "a3")

                titulo  preco_ingresso
0  Vingadores Ultimato            20.0
1            Toy Story            15.5
2    O Poderoso Chefão            25.0

<b>A5</b> Seleciona o nome de todos os clientes com o operador <I>SELECT</I>. Utiliza o operador <I>JOIN</I> para combinar as tabelas clientes e ingressos, exibindo o nome dos clientes que compraram algum ingresso.

In [18]:
a4 = "SELECT nome FROM clientes JOIN ingressos ON clientes.id = ingressos.cliente_id;"
#NÃO ALTERE AS LINHAS ABAIXO
runQuery(a4, "a4")

    nome
0  Alice
1  Bruno
2  Carla

<b>A6</b> Seleciona o titulo de todos os filmes com o operador <I>SELECT</I> e filtra com operador <I>WHERE</I> os que possuem classificação indicativa maior que 16

In [19]:
a5 = "SELECT titulo AS nome FROM filmes WHERE classificacao_indicativa > 16;"
# NÃO ALTERE AS LINHAS ABAIXO
runQuery(a5, "a5")

                nome
0  O Poderoso Chefão

<b>A7</b> Seleciona o nome de todos os clientes e a data de compra de todos os ingressos com o operador <I>SELECT</I>. Utiliza o operador <I>JOIN</I> para combinar as tabelas clientes,ingressos e sessões, exibindo o nome do comprador e a data de compra do ingresso.

In [20]:
a6 = "SELECT nome, data_compra FROM clientes JOIN ingressos ON clientes.id = ingressos.cliente_id JOIN sessoes ON ingressos.sessao_id = sessoes.id;"
# NÃO ALTERE AS LINHAS ABAIXO
runQuery(a6, "a6")

    nome data_compra
0  Alice  2025-05-10
1  Bruno  2025-05-11
2  Carla  2025-05-12

<b>A8</b> Seleciona o titulo de todos os filmes com o operador <I>SELECT</I>. Utiliza o operador <I>JOIN</I> para combinar as tabelas filmes e sessões, exibindo o titulo de todos os filmes exibidos em sessões.

In [21]:
a7 = "SELECT titulo AS nome FROM filmes JOIN sessoes ON filmes.id = sessoes.filme_id;"
# NÃO ALTERE AS LINHAS ABAIXO
runQuery(a7, "a7")

                  nome
0  Vingadores Ultimato
1            Toy Story
2    O Poderoso Chefão

<b>A9</b> Seleciona id de todas as sessões com o operador <I>SELECT</I> e filtra com operador <I>WHERE</I> as sessões disponíveis no dia 25-04-2025

In [22]:
a8 = "SELECT id FROM sessoes WHERE data_hora LIKE '2025-04-25%'"
# NÃO ALTERE AS LINHAS ABAIXO
runQuery(a8, "a8")

Empty DataFrame
Columns: [id]
Index: []

<b>A9</b> Seleciona id de todos os clientes que compraram ingressos com o operador <I>SELECT</I> e quantifica com operador <I>GROUP BY</I> o número de ingressos por cliente.

In [23]:
a9 = "SELECT cliente_id,count(*) FROM ingressos GROUP BY cliente_id HAVING count(*)"
# NÃO ALTERE AS LINHAS ABAIXO
runQuery(a9, "a9")

   cliente_id  count(*)
0           1         1
1           2         1
2           3         1

<b>A10</b> Seleciona o titulo de todos os filmes com o operador <I>SELECT</I>. Utiliza o operador <I>JOIN</I> para combinar as tabelas filmes,sessões e ingressos, exibindo o titulo de todos os filmes que tiveram ingressos vendidos para suas respectivas sessões.

In [24]:
a10 = "SELECT titulo FROM filmes JOIN sessoes ON filmes.id = sessoes.filme_id JOIN ingressos ON ingressos.sessao_id = sessoes.id"
# NÃO ALTERE AS LINHAS ABAIXO
runQuery(a10, "a10")

                titulo
0  Vingadores Ultimato
1            Toy Story
2    O Poderoso Chefão

## PARTE 2 - Consultas SQL
Abaixo, seguem as consultas que voce terá de executar. Altere **APENAS** o espaço entre as aspas. Dentro desse espaço é que você deverá digitar o comando de execução da consulta.

<b>B1</b> Seleciona os filmes com o operador <I>SELECT</I> e filtra com operador <I>WHERE</I> os filmes de gênero 'Comédia'

In [25]:
q1 = "SELECT * FROM filmes WHERE genero = 'Comédia'"
#NÃO ALTERE AS LINHAS ABAIXO
runQuery(q1, "q1")

Empty DataFrame
Columns: [id, titulo, genero, duracao, classificacao_indicativa]
Index: []

<b>B2</b> Seleciona as salas com o operador <I>SELECT</I> e filtra com operador <I>WHERE</I> as que possuem capacidade maior que 150.

In [26]:
q2 = "SELECT * FROM salas WHERE capacidade > 150"
#NÃO ALTERE AS LINHAS ABAIXO
runQuery(q2, "q2")

Empty DataFrame
Columns: [id, nome, capacidade]
Index: []

<b>B2</b> Seleciona as sessões com o operador <I>SELECT</I> e filtra com operador <I>WHERE</I> as que com horário de exibição após ás 18 horas

q3 = "SELECT * FROM sessoes WHERE TIME(data_hora) > '18:00'"
#NÃO ALTERE AS LINHAS ABAIXO
runQuery(q3, "q3")

<b>B3</b> Seleciona o nome de todos os clientes que compraram ingressos com o operador <I>SELECT</I> e quantifica com operador <I>GROUP BY</I> o número de ingressos por cliente.

In [27]:
q4 = "SELECT clientes.nome,count(*) FROM clientes JOIN ingressos ON clientes.id = ingressos.cliente_id GROUP BY clientes.id HAVING count(*)"
#NÃO ALTERE AS LINHAS ABAIXO
runQuery(q4, "q4")

    nome  count(*)
0  Alice         1
1  Bruno         1
2  Carla         1

<b>B4</b> Seleciona id de todas sessões com o operador <I>SELECT</I> e quantifica com operador <I>GROUP BY</I> o a média do preço dos ingressos por sessão.

In [28]:
q5 = "SELECT sessoes.id, avg(sessoes.preco_ingresso) FROM sessoes JOIN ingressos ON sessoes.id = ingressos.sessao_id GROUP BY sessoes.preco_ingresso HAVING avg(sessoes.preco_ingresso)"
#NÃO ALTERE AS LINHAS ABAIXO
runQuery(q5, "q5")

   id  avg(sessoes.preco_ingresso)
0   2                         15.5
1   1                         20.0
2   3                         25.0

<b>B5</b> Seleciona as sessoes com o operador <I>SELECT</I>. Utiliza o operador <I>LEFT JOIN</I> para combinar as tabelas sessões e ingressos, exibindo as sessões que não tiveram ingressos vendidos.

In [29]:
q6 = "SELECT sessoes.* FROM sessoes,ingressos LEFT JOIN ingressos AS i ON sessoes.id = i.sessao_id WHERE i.sessao_id IS NULL"
#NÃO ALTERE AS LINHAS ABAIXO
runQuery(q6, "q6")

Empty DataFrame
Columns: [id, filme_id, sala_id, data_hora, preco_ingresso]
Index: []

<b>B6</b> Seleciona os filmes com mais de 3 sessões com o operador <I>SELECT</I> e quantifica com operador <I>GROUP BY</I> a quantidade de sessões por filme.

In [30]:
q7 = "SELECT filmes.* FROM filmes JOIN sessoes ON filmes.id = sessoes.filme_id GROUP BY filmes.id HAVING count(*) AND count(*) > 3"
#NÃO ALTERE AS LINHAS ABAIXO
runQuery(q7, "q7")

Empty DataFrame
Columns: [id, titulo, genero, duracao, classificacao_indicativa]
Index: []

<b>B7</b> Seleciona os clientes com o operador <I>SELECT</I>. Utiliza o operador <I>JOIN</I> para combinar as tabelas clientes,ingressos e sessões, e filtra com operador <I>WHERE</I> os clientes que compraram ingressos para assistir filmes do gênero drama.

In [31]:
q8 = "SELECT clientes.* FROM filmes JOIN sessoes ON filmes.id = sessoes.filme_id JOIN ingressos ON sessoes.id = ingressos.sessao_id JOIN clientes ON ingressos.cliente_id = clientes.id WHERE filmes.genero ='Drama'"
#NÃO ALTERE AS LINHAS ABAIXO
runQuery(q8, "q8")

   id   nome            email data_nascimento
0   3  Carla  carla@email.com      2003-11-23

<b>B8</b> Seleciona as sessoes com o operador <I>SELECT</I>. Utiliza o operador <I>JOIN</I> para combinar as tabelas filmes e sessões, e filtra com operador <I>WHERE</I> as sessões com titulo 'Vingadores Ultimato'.

In [32]:
q9 = "SELECT sessoes.* FROM filmes JOIN sessoes ON sessoes.filme_id = filmes.id WHERE filmes.titulo LIKE 'Vingadores Ultimato' "
#NÃO ALTERE AS LINHAS ABAIXO
runQuery(q9, "q9")

   id  filme_id  sala_id         data_hora  preco_ingresso
0   1         1        1  2025-05-12 19:30            20.0

<b>B9</b> Seleciona o dia como mais sessoes com o operador <I>SELECT</I> e quantifica com operador <I>GROUP BY</I> a quantidade de sessões por de dia.

In [33]:
q10 = "SELECT data_sessoes.data, MAX(total) FROM(SELECT ingressos.data_compra AS data,count(*) AS total FROM ingressos GROUP BY TIME(ingressos.data_compra) HAVING count(*)) AS data_sessoes"
#NÃO ALTERE AS LINHAS ABAIXO
runQuery(q10, "q10")

         data  MAX(total)
0  2025-05-10           3

# PARTE 3 - Personalização por Matrícula

A entidade <b>trailer</b> possui como chave estrangeira composta pelo identificador do filme referente ao trailer e pelo identificador da sessão em que ele será exibido. Além disso, inclui o atributo <i>duracao_trailer</i>, do tipo INTEGER e não nulo.

### 1. Crie uma nova tabela e, se necessário, altere as demais existentes

In [34]:
#GERA ERRO: 'TypeError: 'NoneType' object is not iterable', no entanto é possível criar a tabela. Caso 'table trailer already exists' retire o comentário da linha a seguir:
#pm0 = "DROP TABLE trailer"

pm0 = "CREATE TABLE trailer (trailer_filme_id INTEGER NOT NULL REFERENCES filmes(id) ON DELETE CASCADE,sessao_id INTEGER NOT NULL REFERENCES sessoes(id),duracao_trailer INTEGER, PRIMARY KEY(trailer_filme_id, sessao_id))"
#NÃO ALTERE AS LINHAS ABAIXO
runQuery(pm0, "pm0")

DatabaseError: Execution failed on sql 'CREATE TABLE trailer (trailer_filme_id INTEGER NOT NULL REFERENCES filmes(id) ON DELETE CASCADE,sessao_id INTEGER NOT NULL REFERENCES sessoes(id),duracao_trailer INTEGER, PRIMARY KEY(trailer_filme_id, sessao_id))': table trailer already exists

In [35]:
trailer = [
    (1, 2, 10),
    (2, 1, 9),
    (2, 3, 15)
]

cur.executemany("INSERT INTO trailer VALUES (?, ?, ?)", trailer)

### 2. Insira aqui a consulta SQL pedida pelo seu número de matrícula

In [36]:
#Títulos dos filmes mostrados nos trailers e títulos e momentos das sessões em que eles foram exibidos
pm1 = "SELECT filme_trailer.titulo_trailer,filme_trailer.momento_sessao, filmes.titulo AS titulo_sessao FROM(SELECT filmes.titulo AS titulo_trailer, sessoes.data_hora AS momento_sessao, sessoes.filme_id AS filme_id_sessao FROM (trailer JOIN filmes ON trailer.trailer_filme_id = filmes.id JOIN sessoes ON trailer.sessao_id = sessoes.id)) AS filme_trailer JOIN filmes ON filme_trailer.filme_id_sessao = filmes.id"
#NÃO ALTERE AS LINHAS ABAIXO
runQuery(pm1, "pm1")

        titulo_trailer    momento_sessao        titulo_sessao
0  Vingadores Ultimato  2025-05-13 14:00            Toy Story
1            Toy Story  2025-05-12 19:30  Vingadores Ultimato
2            Toy Story  2025-05-14 21:00    O Poderoso Chefão

In [37]:
#Filmes em exibição que não tem trailer
pm2 = "SELECT filmes.* FROM trailer RIGHT JOIN filmes ON trailer.trailer_filme_id = filmes.id WHERE trailer.sessao_id IS NULL"
#NÃO ALTERE AS LINHAS ABAIXO
runQuery(pm2, "pm2")

   id             titulo genero  duracao  classificacao_indicativa
0   3  O Poderoso Chefão  Drama      175                        18

# Finalizando o Banco de Dados e o Arquivo de Consultas gerado:

In [38]:
#NÃO ALTERE AS LINHAS ABAIXO
queries.close()
con.close()

## Compactando Arquivos
Na célula abaixo, substitua onde está escrito MATRÍCULA pelo seu número de matrícula.

In [39]:
#ALTERE ONDE ESTÁ ESCRITO MATRICULA para o numero de sua Matrícula
!zip -r "2024024046.zip" "TP1_2024024046.ipynb" "2024024046.csv"

'zip' nÆo ‚ reconhecido como um comando interno
ou externo, um programa oper vel ou um arquivo em lotes.

**LEMBRE-SE:** Após finalizar todas as consultas, clique em *Kernel -> Restart and Run All* no ambiente Jupyter!